[Killed] BlockStatement
src/gilded_rose.mjs:2:56
 export class Item {
-  constructor(name, sellIn, quality, conjured = false) {
-    this.name = name;
-    this.sellIn = sellIn;
-    this.quality = quality;
-    this.conjured = conjured;
-  }
+  constructor(name, sellIn, quality, conjured = false) {}
 }
 
killedBy: Gilded Rose foo
statusReason: expected undefined to equal 'foo'

[Killed] BlockStatement
src/gilded_rose.mjs:15:46
     this.items = items;
   }
 
-  decreaseQuality(item, qualityDecrease = 1) {
-    if (item.quality - qualityDecrease >= 0) {
-      item.quality = item.quality - qualityDecrease;
-    }
-  }
+  decreaseQuality(item, qualityDecrease = 1) {}
 
   increaseQuality(item, qualityIncrease = 1) {
killedBy: Gilded Rose Quality degrades twice as fast after sell by date
statusReason: expected 6 to equal 4

[Killed] ConditionalExpression
src/gilded_rose.mjs:16:9
   }
 
   decreaseQuality(item, qualityDecrease = 1) {
-    if (item.quality - qualityDecrease >= 0) {
+    if (false) {
       item.quality = item.quality - qualityDecrease;
     }
killedBy: Gilded Rose Quality degrades twice as fast after sell by date
statusReason: expected 6 to equal 4

[Killed] ArithmeticOperator
src/gilded_rose.mjs:16:9
   }
 
   decreaseQuality(item, qualityDecrease = 1) {
-    if (item.quality - qualityDecrease >= 0) {
+    if (item.quality + qualityDecrease >= 0) {
       item.quality = item.quality - qualityDecrease;
     }
killedBy: Gilded Rose Quality is never negative
statusReason: expected -2 to equal +0

[Killed] ArithmeticOperator
src/gilded_rose.mjs:17:22
 
   decreaseQuality(item, qualityDecrease = 1) {
     if (item.quality - qualityDecrease >= 0) {
-      item.quality = item.quality - qualityDecrease;
+      item.quality = item.quality + qualityDecrease;
     }
   }
killedBy: Gilded Rose Quality degrades twice as fast after sell by date
statusReason: expected 8 to equal 4

[Killed] BlockStatement
src/gilded_rose.mjs:21:46
     }
   }
 
-  increaseQuality(item, qualityIncrease = 1) {
-    if (item.quality + qualityIncrease <= 50) {
-      item.quality = item.quality + qualityIncrease;
-    }
-  }
+  increaseQuality(item, qualityIncrease = 1) {}
 
   updateQuality() {
killedBy: Gilded Rose Aged Brie increases in quality
statusReason: expected +0 to equal 1

[Killed] EqualityOperator
src/gilded_rose.mjs:22:9
   }
 
   increaseQuality(item, qualityIncrease = 1) {
-    if (item.quality + qualityIncrease <= 50) {
+    if (item.quality + qualityIncrease > 50) {
       item.quality = item.quality + qualityIncrease;
     }
killedBy: Gilded Rose Aged Brie increases in quality
statusReason: expected +0 to equal 1

[Killed] ConditionalExpression
src/gilded_rose.mjs:22:9
   }
 
   increaseQuality(item, qualityIncrease = 1) {
-    if (item.quality + qualityIncrease <= 50) {
+    if (true) {
       item.quality = item.quality + qualityIncrease;
     }
killedBy: Gilded Rose Quality cant exceed 50
statusReason: expected 51 to equal 50

[Killed] ArithmeticOperator
src/gilded_rose.mjs:23:22
 
   increaseQuality(item, qualityIncrease = 1) {
     if (item.quality + qualityIncrease <= 50) {
-      item.quality = item.quality + qualityIncrease;
+      item.quality = item.quality - qualityIncrease;
     }
   }
killedBy: Gilded Rose Aged Brie increases in quality
statusReason: expected -1 to equal 1

[Killed] EqualityOperator
src/gilded_rose.mjs:29:11
 
   updateQuality() {
     this.items.forEach((item) => {
-      if (item.name === "Sulfuras, Hand of Ragnaros") return;
+      if (item.name !== "Sulfuras, Hand of Ragnaros") return;
 
       const itemIsDegradeable = item.name !== "Aged Brie" && item.name !== "Backstage passes to a TAFKAL80ETC concert";
killedBy: Gilded Rose Sulfuras hand of ragnaros doesnt degrade
statusReason: expected 79 to equal 80

[Killed] ConditionalExpression
src/gilded_rose.mjs:29:11
 
   updateQuality() {
     this.items.forEach((item) => {
-      if (item.name === "Sulfuras, Hand of Ragnaros") return;
+      if (true) return;
 
       const itemIsDegradeable = item.name !== "Aged Brie" && item.name !== "Backstage passes to a TAFKAL80ETC concert";
killedBy: Gilded Rose Aged Brie increases in quality
statusReason: expected +0 to equal 1

[Killed] EqualityOperator
src/gilded_rose.mjs:31:33
     this.items.forEach((item) => {
       if (item.name === "Sulfuras, Hand of Ragnaros") return;
 
-      const itemIsDegradeable = item.name !== "Aged Brie" && item.name !== "Backstage passes to a TAFKAL80ETC concert";
+      const itemIsDegradeable = item.name === "Aged Brie" && item.name !== "Backstage passes to a TAFKAL80ETC concert";
       const isBackstagePass = item.name == "Backstage passes to a TAFKAL80ETC concert";
 
killedBy: Gilded Rose Quality degrades twice as fast after sell by date
statusReason: expected 6 to equal 4

[Killed] EqualityOperator
src/gilded_rose.mjs:31:62
     this.items.forEach((item) => {
       if (item.name === "Sulfuras, Hand of Ragnaros") return;
 
-      const itemIsDegradeable = item.name !== "Aged Brie" && item.name !== "Backstage passes to a TAFKAL80ETC concert";
+      const itemIsDegradeable = item.name !== "Aged Brie" && item.name === "Backstage passes to a TAFKAL80ETC concert";
       const isBackstagePass = item.name == "Backstage passes to a TAFKAL80ETC concert";
 
killedBy: Gilded Rose Quality degrades twice as fast after sell by date
statusReason: expected 6 to equal 4

[Killed] ConditionalExpression
src/gilded_rose.mjs:32:31
       if (item.name === "Sulfuras, Hand of Ragnaros") return;
 
       const itemIsDegradeable = item.name !== "Aged Brie" && item.name !== "Backstage passes to a TAFKAL80ETC concert";
-      const isBackstagePass = item.name == "Backstage passes to a TAFKAL80ETC concert";
+      const isBackstagePass = false;
 
       item.sellIn = item.sellIn - 1;
killedBy: Gilded Rose Backstage pass increases in quality by 2 when sellIn is 10 or less
statusReason: expected +0 to equal 2

[Killed] EqualityOperator
src/gilded_rose.mjs:32:31
       if (item.name === "Sulfuras, Hand of Ragnaros") return;
 
       const itemIsDegradeable = item.name !== "Aged Brie" && item.name !== "Backstage passes to a TAFKAL80ETC concert";
-      const isBackstagePass = item.name == "Backstage passes to a TAFKAL80ETC concert";
+      const isBackstagePass = item.name != "Backstage passes to a TAFKAL80ETC concert";
 
       item.sellIn = item.sellIn - 1;
killedBy: Gilded Rose Aged Brie increases in quality
statusReason: expected 4 to equal 1

[Killed] ArithmeticOperator
src/gilded_rose.mjs:34:21
       const itemIsDegradeable = item.name !== "Aged Brie" && item.name !== "Backstage passes to a TAFKAL80ETC concert";
       const isBackstagePass = item.name == "Backstage passes to a TAFKAL80ETC concert";
 
-      item.sellIn = item.sellIn - 1;
+      item.sellIn = item.sellIn + 1;
 
       if (itemIsDegradeable && item.sellIn > 0) {
killedBy: Gilded Rose Quality degrades twice as fast after sell by date
statusReason: expected 5 to equal 4

[Killed] EqualityOperator
src/gilded_rose.mjs:36:32
 
       item.sellIn = item.sellIn - 1;
 
-      if (itemIsDegradeable && item.sellIn > 0) {
+      if (itemIsDegradeable && item.sellIn <= 0) {
         this.decreaseQuality(item);
       }
killedBy: Gilded Rose Quality degrades twice as fast after sell by date
statusReason: expected 3 to equal 4

[Killed] ConditionalExpression
src/gilded_rose.mjs:36:11
 
       item.sellIn = item.sellIn - 1;
 
-      if (itemIsDegradeable && item.sellIn > 0) {
+      if (true) {
         this.decreaseQuality(item);
       }
killedBy: Gilded Rose Quality degrades twice as fast after sell by date
statusReason: expected 3 to equal 4

[Killed] ConditionalExpression
src/gilded_rose.mjs:40:11
         this.decreaseQuality(item);
       }
 
-      if (item.conjured) this.decreaseQuality(item);
+      if (false) this.decreaseQuality(item);
 
       if (itemIsDegradeable && item.sellIn < 0) {
killedBy: Gilded Rose Conjured items degrade twice as fast
statusReason: expected 9 to equal 8

[Killed] ConditionalExpression
src/gilded_rose.mjs:40:11
         this.decreaseQuality(item);
       }
 
-      if (item.conjured) this.decreaseQuality(item);
+      if (true) this.decreaseQuality(item);
 
       if (itemIsDegradeable && item.sellIn < 0) {
killedBy: Gilded Rose Quality degrades twice as fast after sell by date
statusReason: expected 3 to equal 4

[Killed] BlockStatement
src/gilded_rose.mjs:42:49
 
       if (item.conjured) this.decreaseQuality(item);
 
-      if (itemIsDegradeable && item.sellIn < 0) {
-        this.decreaseQuality(item, 2);
-      }
+      if (itemIsDegradeable && item.sellIn < 0) {}
 
       if (item.name == "Aged Brie") {
killedBy: Gilded Rose Quality degrades twice as fast after sell by date
statusReason: expected 6 to equal 4

[Killed] ConditionalExpression
src/gilded_rose.mjs:42:11
 
       if (item.conjured) this.decreaseQuality(item);
 
-      if (itemIsDegradeable && item.sellIn < 0) {
+      if (true) {
         this.decreaseQuality(item, 2);
       }
killedBy: Gilded Rose Quality cant exceed 50
statusReason: expected 49 to equal 50

[Killed] ConditionalExpression
src/gilded_rose.mjs:46:11
         this.decreaseQuality(item, 2);
       }
 
-      if (item.name == "Aged Brie") {
+      if (true) {
         this.increaseQuality(item);
       }
killedBy: Gilded Rose Quality degrades twice as fast after sell by date
statusReason: expected 5 to equal 4

[Killed] ConditionalExpression
src/gilded_rose.mjs:46:11
         this.decreaseQuality(item, 2);
       }
 
-      if (item.name == "Aged Brie") {
+      if (false) {
         this.increaseQuality(item);
       }
killedBy: Gilded Rose Aged Brie increases in quality
statusReason: expected +0 to equal 1

[Killed] ConditionalExpression
src/gilded_rose.mjs:50:11
         this.increaseQuality(item);
       }
 
-      if (isBackstagePass) {
+      if (true) {
         this.increaseQuality(item);
       }
killedBy: Gilded Rose Aged Brie increases in quality
statusReason: expected 2 to equal 1

[Killed] BlockStatement
src/gilded_rose.mjs:50:28
         this.increaseQuality(item);
       }
 
-      if (isBackstagePass) {
-        this.increaseQuality(item);
-      }
+      if (isBackstagePass) {}
 
       if (isBackstagePass && item.sellIn <= 10) {
killedBy: Gilded Rose Backstage pass increases in quality by 2 when sellIn is 10 or less
statusReason: expected 1 to equal 2

[Killed] ConditionalExpression
src/gilded_rose.mjs:54:11
         this.increaseQuality(item);
       }
 
-      if (isBackstagePass && item.sellIn <= 10) {
+      if (true) {
         this.increaseQuality(item);
       }
killedBy: Gilded Rose Aged Brie increases in quality
statusReason: expected 2 to equal 1

[Killed] BlockStatement
src/gilded_rose.mjs:54:49
         this.increaseQuality(item);
       }
 
-      if (isBackstagePass && item.sellIn <= 10) {
-        this.increaseQuality(item);
-      }
+      if (isBackstagePass && item.sellIn <= 10) {}
 
       if (isBackstagePass && item.sellIn <= 5) {
killedBy: Gilded Rose Backstage pass increases in quality by 2 when sellIn is 10 or less
statusReason: expected 1 to equal 2

[Killed] ConditionalExpression
src/gilded_rose.mjs:58:11
         this.increaseQuality(item);
       }
 
-      if (isBackstagePass && item.sellIn <= 5) {
+      if (false) {
         this.increaseQuality(item);
       }
killedBy: Gilded Rose Backstage pass increases in quality by 3 when sellIn is 5 or less
statusReason: expected 2 to equal 3

[Killed] BlockStatement
src/gilded_rose.mjs:58:48
         this.increaseQuality(item);
       }
 
-      if (isBackstagePass && item.sellIn <= 5) {
-        this.increaseQuality(item);
-      }
+      if (isBackstagePass && item.sellIn <= 5) {}
 
       if (isBackstagePass && item.sellIn < 0) {
killedBy: Gilded Rose Backstage pass increases in quality by 3 when sellIn is 5 or less
statusReason: expected 2 to equal 3

[Killed] ConditionalExpression
src/gilded_rose.mjs:62:11
         this.increaseQuality(item);
       }
 
-      if (isBackstagePass && item.sellIn < 0) {
+      if (true) {
         item.quality = 0;
       }
killedBy: Gilded Rose Aged Brie increases in quality
statusReason: expected +0 to equal 1

[Killed] EqualityOperator
src/gilded_rose.mjs:62:30
         this.increaseQuality(item);
       }
 
-      if (isBackstagePass && item.sellIn < 0) {
+      if (isBackstagePass && item.sellIn >= 0) {
         item.quality = 0;
       }
killedBy: Gilded Rose Backstage pass increases in quality by 2 when sellIn is 10 or less
statusReason: expected +0 to equal 2
